trade_exp/src/Documents/ЛистСогласования/ЛистСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЛистСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="bd7ea247-d70a-4d92-8cd1-47dd38150946">
    <name>ЗадолженностьПоДоговору</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="3512a52c-9acd-45aa-804a-ca5be089f33f">
    <name>ЗадолженностьПоПартнеру</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c0bc5285-0919-4f85-a76a-917121dc97f7">
    <name>Проблема</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="89f1256b-558f-47e6-9ac4-50effd1ea3da">
    <name>ДатаИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1e3352f3-d5d8-490e-bf93-180010c0e2bc">
    <name>Согласовано</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2aa8b804-d300-40d4-8612-ffc4be650575">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="4ea323fd-1fd1-401c-8754-d23f642bbee1">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e25d6271-38c5-420f-857c-1046650bddb2">
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5eb42b1f-fbbe-48cd-b72e-a17e84f5b3fd">
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2969a8aa-a5b3-4ce7-81b3-c196f690ff12">
    <name>Согласован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2664f229-27c5-4ab7-bdcc-6e1f12591738">
    <name>Исполнен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="79deed0e-4a1e-4e98-abff-d97cca969ea3">
    <name>ОсновнойМенеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cd483cea-3167-4be8-9a7b-907195fed864">
    <name>ОплатаДо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="a82a6d7e-91c4-476b-846d-35797a773436">
    <name>Исполнитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c21d35e3-631d-41e4-97ad-6641158d01f1">
    <name>Согласователь</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="64f86b4c-7d54-46b4-ac7a-f66b7c8a4ed3">
    <name>ДатаРегистрацииИсполнения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="61d8cf96-a87b-4b3f-82bd-f47b88a0a6b2">
    <name>ДатаРегистрацииСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9696be9-259d-48d2-acae-a488245743b7">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7a11fe18-5ed9-4686-81a4-2c953068f858">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0e10f187-eed8-4a74-ad3f-41977c655684">
    <name>ОстатокДоступногоЛимита</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="1a49d888-bd7f-4334-8ff8-e93a57cb570a">
    <name>СуммаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="526eac68-cb4b-4908-bc13-1a77e20acbf6">
    <name>Аннулирован</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bc47dd80-4fa8-4382-85cc-0bb2a6ea2344">
    <name>ДатаРегистрацииАннулирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="eb1f6b46-b63a-41b8-be2a-95d8f14c5069">
    <name>ПользовательАннулировал</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="061685f0-091a-457d-9c28-92025f6c5b4f">
    <name>СуммаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="0bf38673-8ec2-4f32-8979-463fb5698aa6">
    <name>ДокументыСданы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e0147949-9ac7-484e-a0ca-8b34f672cff8">
    <name>НомерДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="164c893d-909d-49d8-a7ba-800c18b6d039">
    <name>ДатаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f4b22395-72bb-4776-b524-cfb53c57a4f4">
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="550c31a7-7fbc-4734-a07f-2c1c7740b581">
    <name>АвторДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="28ad8094-987b-4a04-be24-8dfc5c80007b">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="233e2c0e-f8f8-4b89-8226-26d79824c73b">
    <name>ТелефонВодителя</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="9d617b0f-530e-468c-9892-04f5cb814fd8">
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="67a5e386-695b-4a2d-b797-85e8575cd0d9">
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="adf90053-7b0e-4c0c-b68f-dea98e3d5512">
    <name>ЗакрывающийДокумент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b202c1c5-6f08-4c5a-a971-994b3a823381">
    <name>ПричинаАнулирования</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="f48d72a7-688f-4060-9471-78ce17ef6985">
    <name>ДокументыСданыКомментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="651738b7-f1d8-42b6-8715-ecf95d1cf2e6">
    <name>СогласованиеПросроченнойЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1bc5b57-b12c-4d9d-8031-2f2f4a41c589">
    <name>МАП</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="4441e03a-af91-4f94-b3af-ef3e1da779c9">
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="311a625c-24d8-4904-b476-ab8a851af32e">
    <name>ДатаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="af9eb79a-5875-48dd-a78f-f6b647d35e28">
    <name>СчетФактура</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="29b69425-b470-40ba-a4e7-ccf20f0881a0">
    <name>ОтправленоСогласователю</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bb028d7b-43a8-477f-9304-ad8ecc5530a4">
    <name>ДатаПередачиВБухгалтерию</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1900bbe4-7fbe-47c9-9810-e3bd898afe33">
    <name>СтатусЛистаСогласования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ce52be8e-dbd2-4c4b-b7a7-611e5ca5521c">
    <name>ЕстьМаркированныйТовар</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a9084dcf-265d-4098-820d-eccd4153f5d6">
    <name>ОтправленоМенеджеру</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="07c7c64e-3afa-4b32-b3c3-4aca4478e4e0">
    <name>Проблемы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="78b64a6c-b2f2-484c-8326-b668f1343f0e">
      <name>ПроблемаРасшифровка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6bf3592f-8fd6-4297-970c-6377faa8eec4">
      <name>Выполнено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="f315772c-11c4-4d38-86f9-344a698693fe">
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ВидыОперацийЛистовСогласования/ВидыОперацийЛистовСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4e174d0c-fcf4-4edb-b771-d537842fb500">
  <name>ВидыОперацийЛистовСогласования</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="0d0f242a-48ae-475d-ad76-05749bd4f77a">
    <name>СогласованиеТранзитов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="462fe71b-3cb9-4c1c-9888-bdb3e6556265">
    <name>СогласованиеЗадолженности</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="37f89f9f-becc-4e83-9791-d21c6238816b">
    <name>СогласованиеОформления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ЛистСогласования/Forms/ФормаСписка/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Основание") Тогда
		Если ЗначениеЗаполнено(Параметры.Основание) Тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Основание", Параметры.Основание, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(Параметры.Основание));
			Элементы.ГруппаОтбор.Видимость= Ложь;
		КонецЕсли;
	КонецЕсли;
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   
	
	СвойстваСписка = ОбщегоНазначения.СтруктураСвойствДинамическогоСписка();
	СвойстваСписка.ОсновнаяТаблица = "Документ.ЛистСогласования";
	СвойстваСписка.ДинамическоеСчитываниеДанных = Истина;
	ТекстЗапроса = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДокументЛистСогласования.Ссылка КАК Ссылка,
	               |	ДокументЛистСогласования.ПометкаУдаления КАК ПометкаУдаления,
	               |	ДокументЛистСогласования.Номер КАК Номер,
	               |	ДокументЛистСогласования.Дата КАК Дата,
	               |	ДокументЛистСогласования.Проведен КАК Проведен,
	               |	ДокументЛистСогласования.ЗадолженностьПоДоговору КАК ЗадолженностьПоДоговору,
	               |	ДокументЛистСогласования.ЗадолженностьПоПартнеру КАК ЗадолженностьПоПартнеру,
	               |	ДокументЛистСогласования.Проблема КАК Проблема,
	               |	ДокументЛистСогласования.ДатаИсполнения КАК ДатаИсполнения,
	               |	ДокументЛистСогласования.Согласовано КАК Согласовано,
	               |	ДокументЛистСогласования.Комментарий КАК Комментарий,
	               |	ДокументЛистСогласования.Автор КАК Автор,
	               |	ДокументЛистСогласования.ВидОперации КАК ВидОперации,
	               |	ДокументЛистСогласования.Основание.Ссылка КАК Основание,
	               |	ДокументЛистСогласования.Основание.Контрагент КАК Контрагент,
	               |	ДокументЛистСогласования.Согласован КАК Согласован,
	               |	ДокументЛистСогласования.Исполнен КАК Исполнен,
	               |	ДокументЛистСогласования.ОсновнойМенеджер КАК ОсновнойМенеджер,
	               |	ДокументЛистСогласования.ОплатаДо КАК ОплатаДо,
	               |	ДокументЛистСогласования.Исполнитель КАК Исполнитель,
	               |	ДокументЛистСогласования.Согласователь КАК Согласователь,
	               |	ДокументЛистСогласования.ДатаРегистрацииИсполнения КАК ДатаРегистрацииИсполнения,
	               |	ДокументЛистСогласования.ДатаРегистрацииСогласования КАК ДатаРегистрацииСогласования,
	               |	ДокументЛистСогласования.Организация КАК Организация,
	               |	ДокументЛистСогласования.СуммаДокумента КАК СуммаДокумента,
	               |	ДокументЛистСогласования.ОстатокДоступногоЛимита КАК ОстатокДоступногоЛимита,
	               |	ДокументЛистСогласования.СуммаОплаты КАК СуммаОплаты,
	               |	ДокументЛистСогласования.Аннулирован КАК Аннулирован,
	               |	ДокументЛистСогласования.ДатаРегистрацииАннулирования КАК ДатаРегистрацииАннулирования,
	               |	ДокументЛистСогласования.ПользовательАннулировал КАК ПользовательАннулировал,
	               |	ДокументЛистСогласования.СуммаСогласования КАК СуммаСогласования,
	               |	ДокументЛистСогласования.МоментВремени КАК МоментВремени,
	               |	ДокументЛистСогласования.Согласовано.Пользователь КАК СогласованоПользователь,
	               |	ДокументЛистСогласования.СуммаДокумента - ДокументЛистСогласования.СуммаОплаты КАК ИтоговаяСуммаСогласования,
	               |	ВЫБОР
	               |		КОГДА ЕСТЬNULL(ДокументЛистСогласования.Основание.Кассир.Наименование, 0) <> 0
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ОтметкаКассы,
	               |	ДокументЛистСогласования.ДокументыСданы КАК ДокументыСданы,
	               |	ДокументЛистСогласования.ФормаОплаты КАК ФормаОплаты,
	               |	ДокументЛистСогласования.ДатаДоставки КАК ДатаДоставки,
	               |	ДокументЛистСогласования.СчетФактура КАК СчетФактура,
	               |	ДокументЛистСогласования.ЕстьМаркированныйТовар КАК МаркированныйТовар
	               |ИЗ
	               |	Документ.ЛистСогласования КАК ДокументЛистСогласования";
	СвойстваСписка.ТекстЗапроса = ТекстЗапроса;
	ОбщегоНазначения.УстановитьСвойстваДинамическогоСписка(Элементы.Список,	СвойстваСписка);
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

//Отборы
&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", ОтборОрганизация, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборОрганизация));
КонецПроцедуры
&НаКлиенте
Процедура ОтборВидОперацииПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ВидОперации", ОтборВидОперации, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборВидОперации));
КонецПроцедуры
&НаКлиенте
Процедура ОтборСогласованоПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Согласовано", ОтборСогласовано, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборСогласовано));
КонецПроцедуры
&НаКлиенте
Процедура ОтборОсновнойМенеджерПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ОсновнойМенеджер", ОтборОсновнойМенеджер, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборОсновнойМенеджер));
КонецПроцедуры
&НаКлиенте
Процедура ОтборАвторПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Основание.Автор", ОтборАвтор, ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборАвтор));
КонецПроцедуры
&НаКлиенте
Процедура ОтборСогласованПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Согласован", ОтборСогласован, ВидСравненияКомпоновкиДанных.НеРавно,, ОтборСогласован);
КонецПроцедуры
&НаКлиенте
Процедура ОтборИсполненоПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Исполнен", ОтборИсполнен, ВидСравненияКомпоновкиДанных.НеРавно,, ОтборИсполнен);
КонецПроцедуры
&НаКлиенте
Процедура ОтборАннулированПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Аннулирован", ОтборАннулирован, ВидСравненияКомпоновкиДанных.НеРавно,, ОтборАннулирован);
КонецПроцедуры

&НаКлиенте
Процедура ОтборДатаИсполненияПриИзменении(Элемент)
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ДатаИсполнения", НачалоМесяца(ОтборДатаИсполнения), ВидСравненияКомпоновкиДанных.БольшеИлиРавно,, ЗначениеЗаполнено(ОтборДатаИсполнения));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ДатаИсполнения", ОтборДатаИсполнения, ВидСравненияКомпоновкиДанных.МеньшеИлиРавно,, ЗначениеЗаполнено(ОтборДатаИсполнения));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Исполнен", ЗначениеЗаполнено(ОтборДатаИсполнения), ВидСравненияКомпоновкиДанных.Равно,, ЗначениеЗаполнено(ОтборДатаИсполнения));
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Аннулирован", ЗначениеЗаполнено(ОтборДатаИсполнения), ВидСравненияКомпоновкиДанных.НеРавно,, ЗначениеЗаполнено(ОтборДатаИсполнения));
КонецПроцедуры
//-Отборы

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Элемент.ТекущиеДанные.ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыОперацийЛистовСогласования.СогласованиеОформления") 
		ИЛИ Элемент.ТекущиеДанные.Исполнен	Тогда
		Отказ= Истина;
	КонецЕсли;
	
	Если Не ИмеетПравоРедактироватьДатуИсполнения() Тогда
		Отказ= Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмеетПравоРедактироватьДатуИсполнения()
	Возврат ЛистыСогласованияСервер.ИмеетПравоРедактироватьДатуИсполнения();
КонецФункции
